<json_output>
{
  "agreement": {
    "sections": [
      {
        "name": "Separate Counterparts",
        "description": "This Agreement may be executed in separate counterparts, each of which shall be deemed an original, but all of which together shall constitute one and the same instrument."
      },
      {
        "name": "Limitation on Liability",
        "description": "In no event will either party have any liability for any loss of income, profit, interest or savings by the other party or for any indirect, incidental, consequential, punitive or special damages suffered by the other party, arising from or related to this Agreement, regardless of the form of action, and whether in contract, indemnity, warranty, strict liability or tort (including, without limitation, negligence), or any other legal or equitable grounds, even if such party has been advised of the possibility of such losses or damages. The liability of either party for actual, direct damages resulting from performance or nonperformance under this Agreement, regardless of the form of action, and whether in contract, tort (including, without limitation, negligence), warranty or other legal or equitable grounds, will be limited in the aggregate to the Net Limitation Amount."
      }
    ]
  },
  "parties": [
    {
      "name": "EQUITABLE FINANCIAL LIFE INSURANCE COMPANY",
      "title": "Chief Financial Officer",
      "representative": "Robin M. Raju"
    },
    {
      "name": "EQUITABLE DISTRIBUTORS, LLC",
      "title": "President",
      "representative": "Nick Lane"
    }
  ],
  "scheduleI": {
    "wholesaleSales": {},
    "initialSales": {},
    "support": {},
    "reclassification": {},
    "corporateExpenses": {
      "allocationDriver": "First Year Premium",
      "annualFixedPercentage": "Annual Fixed Percentage",
      "allocationMethod": "Total expenses related to wholesale sales are allocated to Equitable Distributors from Equitable Financial and its affiliates.",
      "rationale": [
        {
          "description": "Expenses are 100% dedicated to wholesale product sales within the Lines of Business for all products."
        },
        {
          "description": "First year premium is a key indicator of sales efforts by distribution channel."
        },
        {
          "description": "Sales support reclassification to identify the sales support split between all distribution channels and Equitable Distributors."
        }
      ]
    }
  }
}
</json_output>